/**
MIT License

Copyright (c) 2021 Yohei Kakiuchi (youhei@jsk.imi.i.u-tokyo.ac.jp)

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.
 */

#include <stdio.h>
#include <string.h>
#include <inttypes.h>
#include <pthread.h>

// for parsing option
#include <boost/format.hpp>
#include <boost/program_options.hpp>

#include "realtime_task.h"    // elmo_shm/include
#include "elmo_common.h"      // elmo_shm/include
#include "driver_parameter.h" // elmo_shm/include
#include <errno.h>
#include <sys/ipc.h>
#include <sys/types.h>
#include <sys/shm.h>
#include <sys/time.h> // gettimeofday
#include <signal.h>

#include <vector>
#include <string>
#include <cmath>
#include <memory> // shared_ptr
#include "IIRFilter.h"
#include "servo_shm.h"

extern void *display_thread_fun (void *arg);
extern void exit_with_no(int);

// log
#include "shm_logger.h"
shm_logger shm_log;

//
uint16_t rxpdo_set[] = {0x160F, 0x160C, 0x1618, 0x160A, 0x160B};
uint16_t txpdo_set[] = {0x1A0E, 0x1A11, 0x1A1E, 0x1A1F, 0x1A18,
                        0x1A22, 0x1A21,
                        0x1A0A, 0x1A0B};

#pragma pack(2)
typedef struct _rxpdo_buffer {
  int32 target_position; //0x160F 0x607A s32 Target Position
  //  int32 target_velocity; //0x161C 0x60FF s32 Target Velocity
  //  int32 digital_output;  //0x161D 0x60FE:1 s32 Digital Output
  int16 target_torque;   //0x160C 0x6071 s16 Target Torque
  int16 torque_offset;   //0x1618 0x60B2 16 Torque Offset
  uint16 control_word;   //0x160A 0x6040 u16 Control Word
  uint8  mode_of_op;     //0x160B 0x6060 u8  Mode Of Operation
} rxpdo_buffer;
typedef struct _txpdo_buffer {
  int32 position_actual; //0x1A0E 0x6064 32 Position actual value
  int32 velocity_actual; //0x1A11 0x606C 32 Velocity actual value
  int32 aux_position;    //0x1A1E 0x20A0 32 Auxiliary position actual value
  //  uint32 digital_input;  //0x1A1C 0x60FD 32 Digital Inputs
  //  int16 torque_actual;   //0x1A13 0x6077 16 Torque actual value
  int16 current_actual;  //0x1A1F 0x6078 16 Current actual value
  // int16 analog_input;    //0x1A1D 0x2205 16 Analog input
  // int16 torque_demand;   //0x1A12 0x6074 16 Torque demand value
  uint32 dc_volt;      //0x1A18 0x6079 32 DC link circuit voltage
  uint32 elmo_status;  //0x1A22 0x1002 32 ELMO Status Register
  uint16 extra_status; //0x1A21 0x2085 16 Extra Status Register
  uint16 status_word;    //0x1A0A 0x6041 16 Status word
  uint8 mode_of_op;      //0x1A0B 0x6061 8 Mode of operation display
  } txpdo_buffer;
#pragma pack(0)

#define MAX_WORKER_NUM 15
//
//#define REALTIME_CYCLE 250 // 250us
//#define REALTIME_CYCLE 500 // 500us
#define REALTIME_CYCLE 1000 // 1000us

// for jsk_single_axis settings
#define MY_PI 3.141592653589793116

#define MOTOR_START_TEMP 50  // degree celsius
#define MOTOR_MAX_TEMP  120  // degree celsius with safty gap (MAX: 155 deg celsius)
#define ATMOSPHERE_TEMP  25  // degree celsius

enum SHM_STATE {
  SHM_DEFAULT,
  SHM_SERVO_ON,
  SHM_SERVO_OFF,
  SHM_IN_OPERATION,
  SHM_WAITING,
};
typedef enum SHM_STATE shm_state;

//// SOEM global variables
char IOmap[4096];
OSAL_THREAD_HANDLE thread1;
int expectedWKC;

// TODO: should be thread_safe
bool needlf;
volatile int wkc;
bool inOP = false;
uint8 currentgroup = 0;

//// global variables
volatile int stop_flag = 0;
bool calibration_mode = false;
bool use_hrpsys = true;
std::vector<driver_parameter> drv_params;
long zero_count = 0;

